todos/2024/2024-10/2024-10-21~25.org
#+OPTIONS: ^:{} H:0 num:0

* 2024-10-21~25
** Utopia
- [ ] test setting
- [ ] cljs setting
- [ ] web socket setting
- [ ] malli schema 만들기
- [ ] auth
** 개인 공부
*** Computer Networking
**** 4. 네트워크 계층: 데이터 평면
- [X] 4.3. 인터넷 프로토콜(IP): IPv4, 주소 지정, IPv6 등
- [X] 4.4. 일반적인 포워딩 및 소프트웨어 기반 네트워크(SDN)
- [X] 4.5. 요약
**** 5. 네트워크 계층: 제어 평면
- [X] 5.1. 개요
- [X] 5.2. 라우팅 알고리즘
- [X] 5.3. 인터넷에서의 AS 내부 라우팅: OSPF
- [X] 5.4. 인터넷 서비스 제공업자(ISP) 간의 라우팅: BGP
- [X] 5.5. 소프트웨어 정의 네트워크(SDN) 제어 평면
- [X] 5.6. 인터넷 제어 메세지 프로토콜(ICMP)
- [X] 5.7. 네트워크 관리와 SNMP
- [X] 5.8. 요약
**** 6. 링크 계층: 링크, 접속망, 랜
- [X] 6.1 링크 계층 소개
- [X] 6.2. 오류 검출 및 정정기술
- [ ] 6.3. 다중 접속 링크와 프로토콜
*** Docker
*** Kubernetes
*** Jenkins
*** Elk Stack
*** Prometheus Grafana
*** 데이터베이스 시스템
*** Kafka
*** Hadoop
*** Hive
*** Scala
*** Spark
*** 데이터 중심 애플리케이션 설계
*** gRPC
*** nginX
*** Category Theory For Programmers
*** Structure and Interpretation of Computer Programs
*** The Joy of Clojure
*** Clojure 최적화
*** MongoDB
*** Redis
*** C++ 기초 플러스
*** CUDA C Programming
*** 밑바닥부터 시작하는 딥러닝
*** 밑바닥부터 시작하는 딥러닝 2
*** 밑바닥부터 시작하는 딥러닝 3
*** 핸즈온 머신러닝
*** Scala 머신러닝
*** SQL (고급사용 및 최적화)
*** Java 최적화
