todos/2024/2024-10/2024-10-21~25.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-11-01 Fri 15:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="kwonryul" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="file:///home/kwonryul/.emacs.d/css/org.css" />
</head>
<body>
<div id="content" class="content">

<ul class="org-ul">
<li><a id="orgacb0913"></a>2024-10-21~25<br />
<ul class="org-ul">
<li><a id="org02523e1"></a>Utopia<br />
<div class="outline-text-3" id="text-org02523e1">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> test setting</li>
<li class="off"><code>[&#xa0;]</code> cljs setting</li>
<li class="off"><code>[&#xa0;]</code> web socket setting</li>
<li class="off"><code>[&#xa0;]</code> malli schema 만들기</li>
<li class="off"><code>[&#xa0;]</code> auth</li>
</ul>
</div>
</li>
<li><a id="orgac22da6"></a>개인 공부<br />
<ul class="org-ul">
<li><a id="orgd4e8447"></a>Computer Networking<br />
<ul class="org-ul">
<li><a id="org77de65f"></a>4. 네트워크 계층: 데이터 평면<br />
<div class="outline-text-5" id="text-org77de65f">
<ul class="org-ul">
<li class="on"><code>[X]</code> 4.3. 인터넷 프로토콜(IP): IPv4, 주소 지정, IPv6 등</li>
<li class="on"><code>[X]</code> 4.4. 일반적인 포워딩 및 소프트웨어 기반 네트워크(SDN)</li>
<li class="on"><code>[X]</code> 4.5. 요약</li>
</ul>
</div>
</li>
<li><a id="org62e3115"></a>5. 네트워크 계층: 제어 평면<br />
<div class="outline-text-5" id="text-org62e3115">
<ul class="org-ul">
<li class="on"><code>[X]</code> 5.1. 개요</li>
<li class="on"><code>[X]</code> 5.2. 라우팅 알고리즘</li>
<li class="on"><code>[X]</code> 5.3. 인터넷에서의 AS 내부 라우팅: OSPF</li>
<li class="on"><code>[X]</code> 5.4. 인터넷 서비스 제공업자(ISP) 간의 라우팅: BGP</li>
<li class="on"><code>[X]</code> 5.5. 소프트웨어 정의 네트워크(SDN) 제어 평면</li>
<li class="on"><code>[X]</code> 5.6. 인터넷 제어 메세지 프로토콜(ICMP)</li>
<li class="on"><code>[X]</code> 5.7. 네트워크 관리와 SNMP</li>
<li class="on"><code>[X]</code> 5.8. 요약</li>
</ul>
</div>
</li>
<li><a id="orgdac7485"></a>6. 링크 계층: 링크, 접속망, 랜<br />
<div class="outline-text-5" id="text-orgdac7485">
<ul class="org-ul">
<li class="on"><code>[X]</code> 6.1 링크 계층 소개</li>
<li class="on"><code>[X]</code> 6.2. 오류 검출 및 정정기술</li>
<li class="off"><code>[&#xa0;]</code> 6.3. 다중 접속 링크와 프로토콜</li>
</ul>
</div>
</li>
</ul>
</li>
<li><a id="orgb8a78df"></a>Docker<br /></li>
<li><a id="org22e7893"></a>Kubernetes<br /></li>
<li><a id="orgca8a67c"></a>Jenkins<br /></li>
<li><a id="org72489a4"></a>Elk Stack<br /></li>
<li><a id="org88f2a7e"></a>Prometheus Grafana<br /></li>
<li><a id="org4e22a36"></a>데이터베이스 시스템<br /></li>
<li><a id="orgfc710cf"></a>Kafka<br /></li>
<li><a id="org48ef33c"></a>Hadoop<br /></li>
<li><a id="org667afed"></a>Hive<br /></li>
<li><a id="org4388563"></a>Scala<br /></li>
<li><a id="org2e5a886"></a>Spark<br /></li>
<li><a id="org99facbc"></a>데이터 중심 애플리케이션 설계<br /></li>
<li><a id="orgf152b1e"></a>gRPC<br /></li>
<li><a id="org5cb158b"></a>nginX<br /></li>
<li><a id="org7ef7972"></a>Category Theory For Programmers<br /></li>
<li><a id="org68f3fe2"></a>Structure and Interpretation of Computer Programs<br /></li>
<li><a id="org510278c"></a>The Joy of Clojure<br /></li>
<li><a id="org49a57f3"></a>Clojure 최적화<br /></li>
<li><a id="org7a1bb97"></a>MongoDB<br /></li>
<li><a id="org9135be4"></a>Redis<br /></li>
<li><a id="orgdfb241e"></a>C++ 기초 플러스<br /></li>
<li><a id="orgf3ee478"></a>CUDA C Programming<br /></li>
<li><a id="org3d96b35"></a>밑바닥부터 시작하는 딥러닝<br /></li>
<li><a id="org2f02ae6"></a>밑바닥부터 시작하는 딥러닝 2<br /></li>
<li><a id="orgbea7586"></a>밑바닥부터 시작하는 딥러닝 3<br /></li>
<li><a id="org3b36ee2"></a>핸즈온 머신러닝<br /></li>
<li><a id="orga5c1401"></a>Scala 머신러닝<br /></li>
<li><a id="org919f645"></a>SQL (고급사용 및 최적화)<br /></li>
<li><a id="org01a1454"></a>Java 최적화<br /></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
<div id="postamble" class="status">
<p class="author">Author: kwonryul</p>
<p class="date">Created: 2024-11-01 Fri 15:38</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
